/**
 * 2021防疫控疫右侧图表数据
 */
const ncov_chart_2021 = {
    // 重点人员管控
    peopleControl: {
        // 管控人员总数
        total: 580,
        // 境内
        domestic: 257,
        // 境外
        overseas: 323,
        // 时间
        date: "2021年1月16日",
        // 区域列表
        list: {
            /**
             * 数据顺序
             * 现有管控人数、新增管控、居家隔离、集中隔离、日常健康隔离
             */
            石家庄: [173, 26, 87, 49, 45],
            邢台: [10, 0, 10, 0, 0],
            绥化: [9, 0, 2, 3, 4],
            齐齐哈尔: [0, 0, 0, 0, 0],
            廊坊: [35, 2, 8, 16, 13],
            北京: [1, 0, 1, 0, 0],
            沈阳: [26, 0, 10, 12, 4],
            大连: [3, 0, 3, 0, 0],
            境外: [323, 20, 13, 27, 2],
        }
    },

    // 隔离点人员住宿情况
    accommodation: {
        // 隔离点数量
        isolatedPointNum: 44,
        // 启用隔离点
        enable: 2,
        // 备用隔离点
        standby: 42,
        // 爆满
        full: 0,
        // 可容纳人数
        capacity: 4478
    },

    // 街道核酸采样点分布
    streetSamplingPoint: {
        七都街道: 7,
        山福镇: 18,
        仰义街道: 30,
        广化街道: 51,
        丰门街道: 54,
        大南街道: 59,
        南郊街道: 63,
        五马街道: 70,
        双屿街道: 74,
        藤桥镇: 84,
        南汇街道: 86,
        蒲鞋市街道: 96,
        松台街道: 106,
        滨江街道: 111
    },

    // 社区核酸采样点分布
    communitySamplingPoint: {
        广化街道: {
            月湖: 6,
            教场: 8,
            双榕: 6,
            翠微: 6,
            特陶: 5,
            集善: 6,
            双桥: 6,
            集新: 7
        },
        南郊街道: {
            吴桥: 10,
            西屿: 11,
            滨河: 6,
            东龙: 9,
            丽庆: 8,
            十里亭: 13,
            三板桥: 6
        },
        蒲鞋市街道: {
            芳园: 14,
            绿园: 12,
            青园: 8,
            锦园: 7,
            蒋家桥: 12,
            横河: 18,
            蒲鞋市: 13,
            金丝桥: 12
        },
        大南街道: {
            虞师里: 6,
            双莲桥: 6,
            花柳塘: 13,
            白鹿洲: 7,
            马鞍池: 12,
            山前街: 12,
            荷花: 3
        },
        南汇街道: {
            万源: 10,
            大自然: 8,
            桥儿头: 7,
            春秋: 6,
            金鳞: 4,
            开源: 8,
            南塘: 6,
            绣山: 4,
            清风: 12,
            吕浦: 9,
            龙源: 12
        },
        双屿街道: {
            营楼桥: 10,
            垟田: 5,
            牛岭: 15,
            康龙: 16,
            瓯浦垟: 6,
            双岙: 10,
            黄龙: 12
        },
        仰义街道: {
            渔渡: 3,
            后京: 2,
            前京: 4,
            河岙: 1,
            十里: 2,
            龙川: 1,
            澄沙桥: 7,
            陈村: 2,
            林里: 2,
            钟山: 1,
            垟山: 1,
            馒头驻: 2,
            仰新: 2
        },
        松台街道: {
            半腰桥: 5,
            茶花: 10,
            昌明: 10,
            昌盛: 7,
            桂柑: 8,
            郭公山: 11,
            蛟翔巷: 8,
            锦花: 10,
            来福门: 9,
            菱藕: 7,
            庆年坊: 9,
            水心: 12
        },
        七都街道: {
            上沙村: 1,
            樟里村: 1,
            板桥村: 1,
            老涂村: 1,
            吟州村: 1,
            前沙村: 1,
            江都: 1
        },
        丰门街道: {
            前陈村: 6,
            屿头村: 5,
            岩门村: 5,
            新屿社区: 2,
            嵇师村: 16,
            正岙村: 5,
            上伊村: 7,
            潘岙村: 8
        },
        五马街道: {
            安澜: 5,
            墨池: 6,
            谢池: 5,
            朔门: 4,
            十八家: 6,
            八仙楼: 6,
            黎明西路: 5,
            城西街: 4,
            矮凳桥: 6,
            百里坊: 3,
            府前: 5,
            乘凉: 7,
            鼓楼: 5,
            路湾: 3
        },
        滨江街道: {
            灰桥: 13,
            洪殿: 13,
            陡门: 13,
            浦东: 9,
            杨府山: 11,
            宏源: 18,
            丰汇: 12,
            新田园: 11,
            蒲源: 11
        },
        藤桥镇: {
            藤桥镇: 84
        },
        山福镇: {
            山福镇: 18
        }
    }
}

window.ncov_chart_2021 = ncov_chart_2021;